// Домашнее задание

// 1) Почитать про принципы программирования KISS, DRY, YAGNI + почитать про "Антипаттерны" Чистого кода
// 2) Прочитать про способы хранения LocalStorage, SessionStorage и Cookie
// 3) HTML / CSS - Базовая структура html документа, БЭМ методология
// 4) Почитать про паттерны функционального программирования + посмотреть примеры использования
// 5) Способы позиционирования контента на странице
// 6) Веса селекторов

// ======================================================================

// 1)
